In [26]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as pp
import sklearn.linear_model

In [27]:
#loading every data and adding crop name and removing seed if there
#1-banana
data=pd.read_excel("./data/data_folder/banana.xls")
data['Crop']='banana'
data_total=data.copy()
data_total
len(data),len(data_total)

(47, 47)

In [28]:
#2-barley
data=pd.read_excel('./data/data_folder/ginger.xls')
#data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='ginger'
data_total=pd.concat([data_total,data],axis=0)
len(data),len(data_total)
#data.head()

(47, 94)

In [29]:
#3-ginger
data=pd.read_excel('./data/data_folder/barley.xls')
data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='barley'
data_total=pd.concat([data_total,data],axis=0)
len(data),len(data_total)

(47, 141)

In [30]:
#4-papaya
data=pd.read_excel('./data/data_folder/papaya.xls')
#data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='papaya'
data_total=pd.concat([data_total,data],axis=0)
len(data),len(data_total)
#data

#len(data_total)

(47, 188)

In [31]:
#5-grape
data=pd.read_excel('./data/data_folder/grape.xls')
#data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='grape'
len(data)
#data
data_total=pd.concat([data_total,data],axis=0)
data_total
len(data),len(data_total)

(47, 235)

In [32]:
#6-green pea
data=pd.read_excel('./data/data_folder/green_pea.xls')
#data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='green_pea'
len(data)
#data
data_total=pd.concat([data_total,data],axis=0)
data_total
len(data),len(data_total)

(47, 282)

In [33]:
#7-pinapple
data=pd.read_excel('./data/data_folder/pineapple.xls')
#data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='pineapple'
len(data)
#data
data_total=pd.concat([data_total,data],axis=0)
data_total
len(data),len(data_total)
data_total.head()

,Date,Area Harvested - Ha,Yield - Hg/Ha,Production Quantity - tonnes,Crop
0,2007-12-31,622200,349829,21766400,banana
1,2006-12-31,600300,347456,20857800,banana
2,2005-12-31,565100,330948,18701900,banana
3,2004-12-31,535000,305203,16328400,banana
4,2003-12-31,498600,277910,13856600,banana

In [34]:
#8-potato
data=pd.read_excel('./data/data_folder/potato.xls')
data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='potato'
len(data)
#data
data_total=pd.concat([data_total,data],axis=0)
data_total
len(data),len(data_total)
data_total.head()

,Date,Area Harvested - Ha,Yield - Hg/Ha,Production Quantity - tonnes,Crop
0,2007-12-31,622200,349829,21766400,banana
1,2006-12-31,600300,347456,20857800,banana
2,2005-12-31,565100,330948,18701900,banana
3,2004-12-31,535000,305203,16328400,banana
4,2003-12-31,498600,277910,13856600,banana

In [35]:
#9-tomato
data=pd.read_excel('./data/data_folder/tomato.xls')
#data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='tomato'
len(data)
#data
data_total=pd.concat([data_total,data],axis=0)
data_total
len(data),len(data_total)
data_total.head()

,Date,Area Harvested - Ha,Yield - Hg/Ha,Production Quantity - tonnes,Crop
0,2007-12-31,622200,349829,21766400,banana
1,2006-12-31,600300,347456,20857800,banana
2,2005-12-31,565100,330948,18701900,banana
3,2004-12-31,535000,305203,16328400,banana
4,2003-12-31,498600,277910,13856600,banana

In [36]:
#10-wheat
data=pd.read_excel('./data/data_folder/wheat.xls')
data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='wheat'
len(data)
#data
data_total=pd.concat([data_total,data],axis=0)
data_total
len(data),len(data_total)
#data_total.head()

(47, 470)

In [37]:
#11-tea
data=pd.read_excel('./data/data_folder/tea.xls')
#data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='tea'
len(data)
#data
data_total=pd.concat([data_total,data],axis=0)
data_total
len(data),len(data_total)
#data_total.head()

(47, 517)

In [38]:
#12-maize
data=pd.read_excel('./data/data_folder/maize.xls')
data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='maize'
len(data)
#data
data_total=pd.concat([data_total,data],axis=0)
data_total
len(data),len(data_total)
#data_total.head()

(47, 564)

In [39]:
#13-rice
data=pd.read_excel('./data/data_folder/rice.xls')
data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='rice'
len(data)
#data
data_total=pd.concat([data_total,data],axis=0)
data_total
len(data),len(data_total)
#data_total.head()

(47, 611)

In [40]:
#14-sugarcane
data=pd.read_excel('./data/data_folder/sugarcane.xls')
data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='sugarcane'
len(data)
#data
data_total=pd.concat([data_total,data],axis=0)
data_total
len(data),len(data_total)
#data_total.head()

(47, 658)

In [41]:
data_total.head()

,Date,Area Harvested - Ha,Yield - Hg/Ha,Production Quantity - tonnes,Crop
0,2007-12-31,622200,349829,21766400,banana
1,2006-12-31,600300,347456,20857800,banana
2,2005-12-31,565100,330948,18701900,banana
3,2004-12-31,535000,305203,16328400,banana
4,2003-12-31,498600,277910,13856600,banana

In [42]:
data_total.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 658 entries, 0 to 46
Data columns (total 5 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   Date                          658 non-null    datetime64[ns]
 1   Area Harvested - Ha           658 non-null    int64
 2   Yield - Hg/Ha                 658 non-null    int64
 3   Production Quantity - tonnes  658 non-null    int64
 4   Crop                          658 non-null    object
dtypes: datetime64[ns](1), int64(3), object(1)
memory usage: 30.8+ KB

In [43]:
#setting proper index , to keep uniqueness
data_total.index=[i for i in range(len(data_total))]

In [44]:
#replacing the Date,which is a timestamp() or datetime() object to year(int64)
data_total['year']=data_total['Date'].dt.year
#deleting Date, column 
data_total.drop('Date',axis=1,inplace=True)
#type(data_total['year'][0])
data_total.head()

,Area Harvested - Ha,Yield - Hg/Ha,Production Quantity - tonnes,Crop,year
0,622200,349829,21766400,banana,2007
1,600300,347456,20857800,banana,2006
2,565100,330948,18701900,banana,2005
3,535000,305203,16328400,banana,2004
4,498600,277910,13856600,banana,2003

In [45]:
#rearranging columns in some other order
cols=data_total.columns.tolist()
cols=cols[-2:]+cols[0:1]+cols[2:3]+cols[1:2]
cols

['Crop',
 'year',
 'Area Harvested - Ha',
 'Production Quantity - tonnes',
 'Yield - Hg/Ha']

In [46]:
#now rearrange the data_total according to these columns
data_total=data_total[cols]
data_total.head()

,Crop,year,Area Harvested - Ha,Production Quantity - tonnes,Yield - Hg/Ha
0,banana,2007,622200,21766400,349829
1,banana,2006,600300,20857800,347456
2,banana,2005,565100,18701900,330948
3,banana,2004,535000,16328400,305203
4,banana,2003,498600,13856600,277910

In [47]:
#exporting to a file
data_total.to_excel('data_complete_arranged.xls')

In [48]:
#shuffling the data so will be easy to divide into train and test data
data_total=data_total.apply(np.random.permutation)
#exporting to filea
data_total.to_excel('data_complete_shuffled.xls')
data_total.head()

,Crop,year,Area Harvested - Ha,Production Quantity - tonnes,Yield - Hg/Ha
0,green_pea,1965,70000,1200000,72506
1,sugarcane,1990,3019000,4221300,15470
2,pineapple,1985,211000,23920000,147500
3,pineapple,1977,80000,179000,100000
4,pineapple,1992,43830,893000,17704